app/controllers/api/v1/auth_controller.rb

      def signin
        user = User.find_for_database_authentication(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "e@a.com"], ["LIMIT", 1]]