app/controllers/api/v1/favorite_place_controller.rb

      def create
        @favorite_place = @current_user.favorite_places.create(favorite_place_params)
---
INSERT INTO "favorite_places" ("user_id", "place_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["place_id", 1], ["created_at", "2018-06-10 19:55:23.059793"], ["updated_at", "2018-06-10 19:55:23.059793"]]

      def destroy
        @favorite_place.destroy
---
DELETE FROM "favorite_places" WHERE "favorite_places"."id" = $1  [["id", 1]]

      def set_favorite_place
        @favorite_place = @current_user.favorite_places.find_by(place_id: params[:id])
---
SELECT  "favorite_places".* FROM "favorite_places" WHERE "favorite_places"."user_id" = $1 AND "favorite_places"."place_id" = $2 LIMIT $3  [["user_id", 1], ["place_id", 1], ["LIMIT", 1]]