app/controllers/api/v1/place_controller.rb

INSERT INTO "places" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Chilli's"], ["created_at", "2018-06-09 23:22:40.727896"], ["updated_at", "2018-06-09 23:22:40.727896"]]
INSERT INTO "addresses" ("address", "longitude", "latitude", "address_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", "Belen"], ["longitude", 1.2], ["latitude", 3.4], ["address_type_id", 1], ["created_at", "2018-06-09 23:22:40.781992"], ["updated_at", "2018-06-09 23:22:40.781992"]]
INSERT INTO "pictures" ("url", "place_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "abc.png"], ["place_id", 3], ["created_at", "2018-06-09 23:22:40.856161"], ["updated_at", "2018-06-09 23:22:40.856161"]]
INSERT INTO "place_addresses" ("place_id", "address_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["place_id", 3], ["address_id", 3], ["created_at", "2018-06-09 23:22:40.823475"], ["updated_at", "2018-06-09 23:22:40.823475"]]
INSERT INTO "place_types" ("place_id", "place_category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["place_id", 4], ["place_category_id", 1], ["created_at", "2018-06-09 23:23:02.974509"], ["updated_at", "2018-06-09 23:23:02.974509"]]
---
      def create
        @place = Place.create(place_params)
        @address = Address.create(address_params)
        @place.address = @address

        pictures_params.each do |picture|
          @place.pictures.create(url: picture)
        end

        @place.place_types.create!(place_category_id: place_types_params)