app/controllers/api/v1/search_controller.rb

SELECT "places".* FROM "places" WHERE (name LIKE '%%')
---
      def search
        @places = Place.where("name LIKE ?", "%#{search_params}%")