app/controllers/api/v1/user_address_controller.rb

      def set_address
        @address = @current_user.addresses.find(params[:id])
---
SELECT "addresses".* FROM "addresses" INNER JOIN "user_addresses" ON "addresses"."id" = "user_addresses"."address_id" WHERE "user_addresses"."user_id" = $1  [["user_id", 1]]