app/controllers/address_type_controller.rb

  def index
    @address_types = AddressType.all
---
SELECT "address_types".* FROM "address_types"

  def create
    @address_type = AddressType.create!(address_type_params)

    @address_types = AddressType.all
---
INSERT INTO "address_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Home"], ["created_at", "2018-06-08 05:28:40.646680"], ["updated_at", "2018-06-08 05:28:40.646680"]]
SELECT "address_types".* FROM "address_types"

  def update
    @address_type = AddressType.find(params[:id])
    @address_type.update!(address_type_params)
---
SELECT  "address_types".* FROM "address_types" WHERE "address_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "address_types" SET "name" = $1, "updated_at" = $2 WHERE "address_types"."id" = $3  [["name", "Homie"], ["updated_at", "2018-06-08 05:29:16.717020"], ["id", 2]]

  def destroy
    @address_type = AddressType.find(params[:id])
    @address_type.destroy
---
SELECT  "address_types".* FROM "address_types" WHERE "address_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "address_types" WHERE "address_types"."id" = $1  [["id", 2]]