app/controllers/dashboard_news_controller.rb

SELECT "news".* FROM "news"
---
  def index
    @news = News.all

INSERT INTO "news" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hola 2"], ["body", "Hola mundo 2"], ["created_at", "2018-06-09 21:28:24.970257"], ["updated_at", "2018-06-09 21:28:24.970257"]]
SELECT "news".* FROM "news"
---
  def create
    @news = News.create!(news_params)

    @news = News.all

SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "news" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "news"."id" = $4  [["title", "Hola 4"], ["body", "Hola mundo 4"], ["updated_at", "2018-06-09 22:01:12.216512"], ["id", 5]]
---
  def update
    @news = News.find(params[:id])
    @news.update!(news_params)

SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "news" WHERE "news"."id" = $1  [["id", 5]]
---
  def destroy
    @news = News.find(params[:id])
    @news.destroy