app/controllers/dashboard_user_type_controller.rb

  def index
    @user_types = UserType.all
---
SELECT "user_types".* FROM "user_types"

  def create
    @user_type = UserType.create!(user_type_params)

    @user_types = UserType.all
---
INSERT INTO "user_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "No se"], ["created_at", "2018-06-09 23:03:13.723898"], ["updated_at", "2018-06-09 23:03:13.723898"]]
SELECT "user_types".* FROM "user_types"

  def update
    @user_type = UserType.find(params[:id])
    @user_type.update!(user_type_params)
---
SELECT  "user_types".* FROM "user_types" WHERE "user_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "user_types" SET "name" = $1, "updated_at" = $2 WHERE "user_types"."id" = $3  [["name", "Owner"], ["updated_at", "2018-06-09 23:05:48.197310"], ["id", 3]]

  def destroy
    @user_type = UserType.find(params[:id])
    @user_type.destroy
---
SELECT  "user_types".* FROM "user_types" WHERE "user_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "user_types" WHERE "user_types"."id" = $1  [["id", 3]]