app/controllers/dashboard_place_type_controller.rb

SELECT "place_categories".* FROM "place_categories"
---
  def index
    @place_types = PlaceCategory.all

INSERT INTO "place_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Italian"], ["created_at", "2018-06-10 00:12:16.610953"], ["updated_at", "2018-06-10 00:12:16.610953"]]
SELECT "place_categories".* FROM "place_categories"
---
  def create
    @place_type = PlaceCategory.create!(place_type_params)

    @place_types = PlaceCategory.all

SELECT  "place_categories".* FROM "place_categories" WHERE "place_categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "place_categories" SET "name" = $1, "updated_at" = $2 WHERE "place_categories"."id" = $3  [["name", "Italianssssss"], ["updated_at", "2018-06-10 00:16:27.878683"], ["id", 4]]
---
  def update
    @place_type = PlaceCategory.find(params[:id])
    @place_type.update!(place_type_params)

SELECT  "place_categories".* FROM "place_categories" WHERE "place_categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "place_categories" WHERE "place_categories"."id" = $1  [["id", 4]]
---
  def destroy
    @place_type = PlaceCategory.find(params[:id])
    @place_type.destroy