app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "e@a.com"], ["LIMIT", 1]]
---
  def signin
    user = User.find_for_database_authentication(email: params[:email])